app/views/seek/new.html.erb

<p> <%= f.label 'Comp:' %>
  <%= f.collection_select :comp_id, Comp.order(:name),:id,:name %> </p>
---
SELECT "comps".* FROM "comps" ORDER BY "comps"."name" ASC