app/controllers/comp_controller.rb

SELECT "comps".* FROM "comps"
---
  def index
    @comps = Comp.all

SELECT  "comps".* FROM "comps" WHERE "comps"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "seeks".* FROM "seeks" WHERE "seeks"."comp_id" = ?  [["comp_id", 2]]
---
  def show
    @comp = Comp.find(params[:id])
    @seeks = @comp.seeks.all