app/controllers/dancer_controller.rb

  def index
    @dancers = Dancer.all
---
SELECT "dancers".* FROM "dancers"