app/controllers/home_controller.rb

  def show
    @comps = Comp.all
---
SELECT "comps".* FROM "comps"