app/controllers/seek_controller.rb

  def create
    if current_user
      @seek = Seek.new(seek_params)
      @seek.user_id = current_user.id
      @seek.is_open = true
      if @seek.save
---
INSERT INTO "seeks" ("user_id", "comp_id", "role", "style", "level", "created_at", "updated_at", "is_open") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["comp_id", 1], ["role", "Leader"], ["style", "Smooth"], ["level", "Gold"], ["created_at", 2016-12-31 19:38:52 UTC], ["updated_at", 2016-12-31 19:38:52 UTC], ["is_open", true]]

  def my_seeks
    if current_user
      @my_seeks = current_user.seeks.all
---
SELECT "seeks".* FROM "seeks" WHERE "seeks"."user_id" = ?  [["user_id", 1]]

  def close_seek
    @seek = Seek.find(params[:id])
    @seek.is_open = false
    @seek.save
---
SELECT  "seeks".* FROM "seeks" WHERE "seeks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "seeks" SET "is_open" = ?, "updated_at" = ? WHERE "seeks"."id" = ?  [["is_open", false], ["updated_at", 2016-12-29 05:46:07 UTC], ["id", 1]]