app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "seeks".* FROM "seeks" WHERE "seeks"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @seeks = @user.seeks.all

UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "Hello! My name is Lexi and I made this app. Please dance with me."], ["updated_at", 2017-01-02 06:34:21 UTC], ["id", 1]]
---
  def save_edit
    @user = current_user
    if @user.update_attributes(user_params)